# Bengaluru House Price Prediction

In [167]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import sklearn

In [168]:
df = pd.read_csv("Bengaluru_House_Data.csv")

In [169]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [170]:
df.shape

(13320, 9)

In [171]:
df.shape

(13320, 9)

In [172]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [173]:
# Value counts in each columns
for columns in df.columns:
    print(df[columns].value_counts())
    print("*"*20)

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64
********************
availability
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: count, Length: 81, dtype: int64
********************
location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64
********************
size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64
********************
society
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: count, Length: 2688, dtype: int64
********************
total_sqft
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: count, Length: 2117, dtype: int64
********************
bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: count, dtype: int64
********************
balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64
********************
price
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: count, Length: 1994, dtype: int64
********************

In [174]:
df.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [175]:
df["size"]

0            2 BHK
1        4 Bedroom
2            3 BHK
3            3 BHK
4            2 BHK
           ...
13315    5 Bedroom
13316        4 BHK
13317        2 BHK
13318        4 BHK
13319        1 BHK
Name: size, Length: 13320, dtype: object

In [176]:
#df.isna().sum()
#and  isnull is same

In [177]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [178]:
df.head(2)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00

In [179]:
# so the features that are not necessaary we will drop them
# society
# Balcony
# area type
# availability
# we will not use it in our model so drop it out

In [180]:
df.drop(columns=['area_type', 'availability', 'balcony', 'society'])

                       location       size total_sqft  bath   price
0      Electronic City Phase II      2 BHK       1056   2.0   39.07
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2                   Uttarahalli      3 BHK       1440   2.0   62.00
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                      Kothanur      2 BHK       1200   2.0   51.00
...                         ...        ...        ...   ...     ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00
13316             Richards Town      4 BHK       3600   5.0  400.00
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00
13319              Doddathoguru      1 BHK        550   1.0   17.00

[13320 rows x 5 columns]

In [181]:
# again df korle chole asbe so inplace true
df.head(2)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00

In [182]:
df.drop(columns=['area_type', 'availability', 'balcony', 'society'], inplace=True)

In [183]:
df  # ebar r asbe na karon inplace true

                       location       size total_sqft  bath   price
0      Electronic City Phase II      2 BHK       1056   2.0   39.07
1              Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2                   Uttarahalli      3 BHK       1440   2.0   62.00
3            Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                      Kothanur      2 BHK       1200   2.0   51.00
...                         ...        ...        ...   ...     ...
13315                Whitefield  5 Bedroom       3453   4.0  231.00
13316             Richards Town      4 BHK       3600   5.0  400.00
13317     Raja Rajeshwari Nagar      2 BHK       1141   2.0   60.00
13318           Padmanabhanagar      4 BHK       4689   4.0  488.00
13319              Doddathoguru      1 BHK        550   1.0   17.00

[13320 rows x 5 columns]

In [184]:
df.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [185]:
# Now Handle Missing values

In [186]:
df.isna().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [187]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [188]:
# 1 missing value in location so handle it
df['location'].value_counts()

location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64

In [189]:
# 1 missing value in location so handle it by fillna method
# we are filling missing value with sarjapur road
df['location'] = df['location'].fillna('Sarjapur Road')

In [190]:
df['location'].isnull().sum()
# missing value gayeb

0

In [191]:
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [192]:
# Now handle size
df["size"].isnull().sum()

# 16 missing values in size

16

In [193]:
df['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [194]:
df['size']

0            2 BHK
1        4 Bedroom
2            3 BHK
3            3 BHK
4            2 BHK
           ...
13315    5 Bedroom
13316        4 BHK
13317        2 BHK
13318        4 BHK
13319        1 BHK
Name: size, Length: 13320, dtype: object

In [195]:
df['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [196]:
import math
median = math.floor(df.size.median())
median
# not possible karon not int value

AttributeError: 'numpy.int32' object has no attribute 'median'

In [197]:
# tahole median values mane jeta besi ache seta die replace kore de

# 2 BHK sobcheye besi ahce

df['size'] = df['size'].fillna('2 BHK')

In [198]:
df['size'].isnull().sum()
# null value gayeb

0

In [199]:
df.head(2)

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00

In [200]:
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [36]:
# now handle bathrooms
df['bath'].isnull().sum()
# 73 null values present

73

In [201]:
df['bath'].value_counts()

bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: count, dtype: int64

In [202]:
# median is 2 here bcz it is majority so replace by 2
df['bath'] = df['bath'].fillna('2.0')

In [203]:
df['bath'].isnull().sum()
# missing value gayeb

0

In [204]:
df.head(2)

                   location       size total_sqft bath   price
0  Electronic City Phase II      2 BHK       1056  2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600  5.0  120.00

In [205]:
df['price'].isnull().sum()

0

In [206]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  object
 4   price       13320 non-null  float64
dtypes: float64(1), object(4)
memory usage: 520.4+ KB

In [207]:
df['size']

0            2 BHK
1        4 Bedroom
2            3 BHK
3            3 BHK
4            2 BHK
           ...
13315    5 Bedroom
13316        4 BHK
13317        2 BHK
13318        4 BHK
13319        1 BHK
Name: size, Length: 13320, dtype: object

In [208]:
df.head()

                   location       size total_sqft bath   price
0  Electronic City Phase II      2 BHK       1056  2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600  5.0  120.00
2               Uttarahalli      3 BHK       1440  2.0   62.00
3        Lingadheeranahalli      3 BHK       1521  3.0   95.00
4                  Kothanur      2 BHK       1200  2.0   51.00

In [209]:
# BHK and Bedroom er problem dur korte hobe
df['bhk'] = df['size'].str.split()
df['bhk']

0            [2, BHK]
1        [4, Bedroom]
2            [3, BHK]
3            [3, BHK]
4            [2, BHK]
             ...
13315    [5, Bedroom]
13316        [4, BHK]
13317        [2, BHK]
13318        [4, BHK]
13319        [1, BHK]
Name: bhk, Length: 13320, dtype: object

In [213]:
df['bhk'] = df['size'].str.split().str.get(0).astype(int)

In [214]:
df.head()

                   location       size total_sqft bath   price  bhk
0  Electronic City Phase II      2 BHK       1056  2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600  5.0  120.00    4
2               Uttarahalli      3 BHK       1440  2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521  3.0   95.00    3
4                  Kothanur      2 BHK       1200  2.0   51.00    2

In [217]:
df['bhk']

0        2
1        4
2        3
3        3
4        2
        ..
13315    5
13316    4
13317    2
13318    4
13319    1
Name: bhk, Length: 13320, dtype: int32

In [218]:
df[df['bhk'] > 20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [219]:
df.head()

                   location       size total_sqft bath   price  bhk
0  Electronic City Phase II      2 BHK       1056  2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600  5.0  120.00    4
2               Uttarahalli      3 BHK       1440  2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521  3.0   95.00    3
4                  Kothanur      2 BHK       1200  2.0   51.00    2

In [220]:
# Now handle total sqft
df['total_sqft'].unique()
# range value presnet ache

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [221]:
df

                       location       size total_sqft bath   price  bhk
0      Electronic City Phase II      2 BHK       1056  2.0   39.07    2
1              Chikka Tirupathi  4 Bedroom       2600  5.0  120.00    4
2                   Uttarahalli      3 BHK       1440  2.0   62.00    3
3            Lingadheeranahalli      3 BHK       1521  3.0   95.00    3
4                      Kothanur      2 BHK       1200  2.0   51.00    2
...                         ...        ...        ...  ...     ...  ...
13315                Whitefield  5 Bedroom       3453  4.0  231.00    5
13316             Richards Town      4 BHK       3600  5.0  400.00    4
13317     Raja Rajeshwari Nagar      2 BHK       1141  2.0   60.00    2
13318           Padmanabhanagar      4 BHK       4689  4.0  488.00    4
13319              Doddathoguru      1 BHK        550  1.0   17.00    1

[13320 rows x 6 columns]

In [222]:
# so for range values we will take mean of these values
# " - " thakle split korbo and sum kore mean korbo
# 1133 - 1384
# for this type

df.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [224]:
print(df['price'].dtype)
print(df['total_sqft'].dtype)

float64
object

In [225]:
def isFloat(x):
    try:
        float(x)
    except:
        return False
    return True

In [226]:
df[df['total_sqft'].apply(isFloat)]

                       location       size total_sqft bath   price  bhk
0      Electronic City Phase II      2 BHK       1056  2.0   39.07    2
1              Chikka Tirupathi  4 Bedroom       2600  5.0  120.00    4
2                   Uttarahalli      3 BHK       1440  2.0   62.00    3
3            Lingadheeranahalli      3 BHK       1521  3.0   95.00    3
4                      Kothanur      2 BHK       1200  2.0   51.00    2
...                         ...        ...        ...  ...     ...  ...
13315                Whitefield  5 Bedroom       3453  4.0  231.00    5
13316             Richards Town      4 BHK       3600  5.0  400.00    4
13317     Raja Rajeshwari Nagar      2 BHK       1141  2.0   60.00    2
13318           Padmanabhanagar      4 BHK       4689  4.0  488.00    4
13319              Doddathoguru      1 BHK        550  1.0   17.00    1

[13073 rows x 6 columns]

In [57]:
df[~df['total_sqft'].apply(isFloat)]

                 location       size   total_sqft bath    price  bhk
30              Yelahanka      4 BHK  2100 - 2850  4.0  186.000    4
56            Devanahalli  4 Bedroom  3010 - 3410  2.0  192.000    4
81            Hennur Road  4 Bedroom  2957 - 3450  2.0  224.500    4
122                Hebbal      4 BHK  3067 - 8156  4.0  477.000    4
137    8th Phase JP Nagar      2 BHK  1042 - 1105  2.0   54.005    2
...                   ...        ...          ...  ...      ...  ...
12990      Talaghattapura      3 BHK  1804 - 2273  3.0  122.000    3
13059              Harlur      2 BHK  1200 - 1470  2.0   72.760    2
13240         Devanahalli      1 BHK  1020 - 1130  2.0   52.570    1
13265               Hoodi      2 BHK  1133 - 1384  2.0   59.135    2
13299          Whitefield      4 BHK  2830 - 2882  5.0  154.500    4

[247 rows x 6 columns]

In [227]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [228]:
df['total_sqft'] = df['total_sqft'].apply(convertRange)

In [229]:
df.head()

                   location       size  total_sqft bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0  2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0  5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0  2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0  3.0   95.00    3
4                  Kothanur      2 BHK      1200.0  2.0   51.00    2

In [230]:
df['price_per_sqft'] = (df['price'] * 100000) / df['total_sqft']

In [231]:
df['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [232]:
df.describe()

         total_sqft         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694    112.565627      2.802778    7.907501e+03
std     1238.405258    148.971674      1.294496    1.064296e+05
min        1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000    120.000000      3.000000    7.311746e+03
max    52272.000000   3600.000000     43.000000    1.200000e+07

In [233]:
# outlier is 1.200000e+07
# max = df.price_per_sqft.quantile([0.999])
# max

In [234]:
# min = df.price_per_sqft.quantile([0.0021])
# min

In [235]:
# min_thresold, max_thresold = df.price_per_sqft.quantile([0.001, 0.999])
# min_thresold, max_thresold

In [236]:
# df[df.price_per_sqft < min_thresold]

In [237]:
# df[df.price_per_sqft > max_thresold]

,location,size,total_sqft,bath,price,bhk,price_per_sqft
349,Suragajakkanahalli,3 Bedroom,11.0,3.0,74.0,3,6.727273e+05
1020,Weavers Colony,1 BHK,15.0,1.0,30.0,1,2.000000e+05
1122,Grihalakshmi Layout,5 Bedroom,24.0,2.0,150.0,5,6.250000e+05
4086,Sarjapur Road,4 Bedroom,1.0,4.0,120.0,4,1.200000e+07
4972,Srirampuram,7 BHK,5.0,7.0,115.0,7,2.300000e+06
5970,Mysore Road,1 Bedroom,45.0,1.0,23.0,1,5.111111e+04
6421,Bommenahalli,4 Bedroom,2940.0,3.0,2250.0,4,7.653061e+04
7088,Srirampuram,1 BHK,650.0,1.0,500.0,1,7.692308e+04
7657,Raghuvanahalli,1 BHK,425.0,1.0,750.0,1,1.764706e+05
7883,Vasanth nagar,4 BHK,2000.0,3.0,1063.0,4,5.315000e+04
8398,Bannerghatta Road,5 BHK,2500.0,4.0,1400.0,5,5.600000e+04
9535,Indira Nagar,4 Bedroom,2400.0,5.0,1250.0,4,5.208333e+04
11558,Whitefield,4 Bedroom,60.0,4.0,218.0,4,3.633333e+05
12443,Dollars Colony,4 Bedroom,4350.0,8.0,2600.0,4,5.977011e+04

In [238]:
# df2 = df[(df.price_per_sqft<max_thresold) & (df.price_per_sqft>min_thresold)]
# df2.shape

In [239]:
# df2.describe()

In [240]:
df['location'].value_counts()

location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Uvce Layout                         1
Abshot Layout                       1
Name: count, Length: 1306, dtype: int64

In [241]:
df['location'] =df['location'].apply(lambda x: x.strip())
location_count = df['location'].value_counts()
#here we try to drop the locations which are coming less than 10 times

In [242]:
location_count

location
Whitefield                            541
Sarjapur  Road                        399
Electronic City                       304
Kanakpura Road                        273
Thanisandra                           237
                                     ...
1Channasandra                           1
Hosahalli                               1
Vijayabank bank layout                  1
near Ramanashree California resort      1
Abshot Layout                           1
Name: count, Length: 1295, dtype: int64

In [243]:
location_count_less_than_10 = location_count[location_count<=10]

In [244]:
location_count_less_than_10

location
BTM 1st Stage                         10
Nagadevanahalli                       10
Basapura                              10
Sector 1 HSR Layout                   10
Dairy Circle                          10
                                      ..
1Channasandra                          1
Hosahalli                              1
Vijayabank bank layout                 1
near Ramanashree California resort     1
Abshot Layout                          1
Name: count, Length: 1054, dtype: int64

In [245]:
# ebar dekhbo location count less 10 jodi 10 er kom hoi then we will replace them with other

In [246]:
df['location'] = df['location'].apply(lambda x: 'other' if x in location_count_less_than_10 else x)

In [247]:
df['location'].value_counts()

location
other                 2886
Whitefield             541
Sarjapur  Road         399
Electronic City        304
Kanakpura Road         273
                      ...
Nehru Nagar             11
Banjara Layout          11
LB Shastri Nagar        11
Pattandur Agrahara      11
Narayanapura            11
Name: count, Length: 242, dtype: int64

In [248]:
# so length decreses to 242

## outlier removal

In [249]:
df.describe()

         total_sqft         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694    112.565627      2.802778    7.907501e+03
std     1238.405258    148.971674      1.294496    1.064296e+05
min        1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000    120.000000      3.000000    7.311746e+03
max    52272.000000   3600.000000     43.000000    1.200000e+07

In [250]:
# now check 1 bhk te koto square fit hoa chai 
# calculate this
# total sqft / bhk
(df['total_sqft'] / df['bhk'])

0         528.00
1         650.00
2         480.00
3         507.00
4         600.00
          ...
13315     690.60
13316     900.00
13317     570.50
13318    1172.25
13319     550.00
Length: 13320, dtype: float64

In [251]:
(df['total_sqft'] / df['bhk']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [252]:
# ekta flat kakhono 300 sqft er kom hote pare na 
# so amra filter kore jegulo 300 sqft er opore value segulo only rakhbo
df = df[(df['total_sqft'] / df['bhk']) >= 300]
df.describe()

         total_sqft         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.564544    111.382401      2.650838     6303.979357
std     1261.271296    152.077329      0.976678     4162.237981
min      300.000000      8.440000      1.000000      267.829813
25%     1116.000000     49.000000      2.000000     4210.526316
50%     1300.000000     70.000000      3.000000     5294.117647
75%     1700.000000    115.000000      3.000000     6916.666667
max    52272.000000   3600.000000     16.000000   176470.588235

In [253]:
df.shape

(12530, 7)

In [254]:
# now check any outlier at price per sqft
df.price_per_sqft.describe()

count     12530.000000
mean       6303.979357
std        4162.237981
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [255]:
# max      176470.588235 outlier   # Remove it
df.head(2)

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615

In [256]:
def remove_outlier(X):
    df_output = pd.DataFrame()
    # location die groupby korlam
    # groupby korle key and subdataframe create hobe
    for key , subdf in X.groupby("location"):

        # protteck ta location e mean price per sqft bar korlam
        m = np.mean(subdf.price_per_sqft)

        # protteck ta location e standard deviation price per sqft bar korlam
        st = np.std(subdf.price_per_sqft)

        # filter kore only jegulo mean theke ek standard deviation er besi and kom sekotai rakhlam , bakigulo drop
        gen_df = subdf[(subdf.price_per_sqft > (m-st)) & (subdf.price_per_sqft <= (m+st))]

        df_output = pd.concat([df_output, gen_df], ignore_index=True)
        
    return df_output
df = remove_outlier(df)
df.describe()

         total_sqft         price           bhk  price_per_sqft
count  10301.000000  10301.000000  10301.000000    10301.000000
mean    1508.440608     91.286372      2.574896     5659.062876
std      880.694214     86.342786      0.897649     2265.774749
min      300.000000     10.000000      1.000000     1250.000000
25%     1110.000000     49.000000      2.000000     4244.897959
50%     1286.000000     67.000000      2.000000     5175.600739
75%     1650.000000    100.000000      3.000000     6428.571429
max    30400.000000   2200.000000     16.000000    24509.803922

In [257]:
# outlier removing from bhk
def remove_bhk_outliers(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')
df8 = remove_bhk_outliers(df)
# df8 = df7.copy()
df8.shape

(7361, 7)

In [258]:
df8.head(5)

              location   size  total_sqft bath  price  bhk  price_per_sqft
0  1st Block Jayanagar  4 BHK      2850.0  4.0  428.0    4    15017.543860
1  1st Block Jayanagar  3 BHK      1630.0  3.0  194.0    3    11901.840491
2  1st Block Jayanagar  3 BHK      1875.0  2.0  235.0    3    12533.333333
3  1st Block Jayanagar  3 BHK      1200.0  2.0  130.0    3    10833.333333
4  1st Block Jayanagar  2 BHK      1235.0  2.0  148.0    2    11983.805668

In [260]:
df8.drop(columns=['size', 'price_per_sqft'], inplace=True)

In [261]:
df8.head()

              location  total_sqft bath  price  bhk
0  1st Block Jayanagar      2850.0  4.0  428.0    4
1  1st Block Jayanagar      1630.0  3.0  194.0    3
2  1st Block Jayanagar      1875.0  2.0  235.0    3
3  1st Block Jayanagar      1200.0  2.0  130.0    3
4  1st Block Jayanagar      1235.0  2.0  148.0    2

In [262]:
df8.to_csv("Cleaned_data.csv")